mamedev/mame/src/devices/cpu/tms32010/tms32010.cpp
// license:BSD-3-Clause
// copyright-holders:Tony La Porta
	/**************************************************************************\
	*                 Texas Instruments TMS32010 DSP Emulator                  *
	*                                                                          *
	*                  Copyright Tony La Porta                                 *
	*                                                                          *
	*      Notes : The term 'DMA' within this document, is in reference        *
	*                  to Direct Memory Addressing, and NOT the usual term     *
	*                  of Direct Memory Access.                                *
	*              This is a word based microcontroller, with addressing       *
	*                  architecture based on the Harvard addressing scheme.    *
	*                                                                          *
	*                                                                          *
	*                                                                          *
	*  **** Change Log ****                                                    *
	*                                                                          *
	*  TLP (13-Jul-2002)                                                       *
	*   - Added Save-State support                                             *
	*   - Converted the pending_irq flag to INTF (a real flag in this device)  *
	*   - Fixed the ignore Interrupt Request for previous critical             *
	*     instructions requiring an extra instruction to be processed. For     *
	*     this reason, instant IRQ servicing cannot be supported here, so      *
	*     INTF needs to be polled within the instruction execution loop        *
	*   - Removed IRQ callback (IRQ ACK not supported on this device)          *
	*   - A pending IRQ will remain pending until it's serviced. De-asserting  *
	*     the IRQ Pin does not remove a pending IRQ state                      *
	*   - BIO is no longer treated as an IRQ line. It's polled when required.  *
	*     This is the true behaviour of the device                             *
	*   - Removed the Clear OV flag from overflow instructions. Overflow       *
	*     instructions can only set the flag. Flag test instructions clear it  *
	*   - Fixed the ABST, SUBC and SUBH instructions                           *
	*   - Fixed the signedness in many equation based instructions             *
	*   - Added the missing Previous PC to the get_register function           *
	*   - Changed Cycle timings to include clock ticks                         *
	*   - Converted some registers from ints to pairs for much cleaner code    *
	*  TLP (20-Jul-2002) Ver 1.10                                              *
	*   - Fixed the dissasembly from the debugger                              *
	*   - Changed all references from TMS320C10 to TMS32010                    *
	*  ASG (24-Sep-2002) Ver 1.20                                              *
	*   - Fixed overflow handling                                              *
	*   - Simplified logic in a few locations                                  *
	*  TLP (22-Feb-2004) Ver 1.21                                              *
	*   - Overflow for ADDH only affects upper 16bits (was modifying 32 bits)  *
	*   - Internal Data Memory map is assigned here now                        *
	*   - Cycle counts for invalid opcodes 7F1E and 7F1F are now 0             *
	*  RK  (23-Nov-2006) Ver 1.22                                              *
	*   - Fixed state of the Overflow Flag on reset                            *
	*   - Fixed the SUBC instruction which was incorrectly zeroing the divisor *
	*  TLP (13-Jul-2010) Ver 1.30                                              *
	*   - LST instruction was incorrectly setting an Indirect Addressing       *
	*     feature when Direct Addressing mode was selected                     *
	*   - Added TMS32015 and TMS32016 variants                                 *
	*  TLP (27-Jul-2010) Ver 1.31                                              *
	*   - Corrected cycle timing for conditional branch instructions           *
	*                                                                          *
	\**************************************************************************/


#include "emu.h"
#include "tms32010.h"
#include "32010dsm.h"
#include "debugger.h"

#include <algorithm>

#define M_RDROM(A)      TMS32010_ROM_RDMEM(A)
#define M_WRTROM(A,V)   TMS32010_ROM_WRMEM(A,V)
#define M_RDRAM(A)      TMS32010_RAM_RDMEM(A)
#define M_WRTRAM(A,V)   TMS32010_RAM_WRMEM(A,V)
#define M_RDOP(A)       TMS32010_RDOP(A)
#define M_RDOP_ARG(A)   TMS32010_RDOP_ARG(A)
#define P_IN(A)         TMS32010_In(A)
#define P_OUT(A,V)      TMS32010_Out(A,V)


DEFINE_DEVICE_TYPE(TMS32010, tms32010_device, "tms32010", "Texas Instruments TMS32010")
// TMS320x14 (4K on-chip ROM with internal peripherals, 4K off-chip program space)
DEFINE_DEVICE_TYPE(TMS32015, tms32015_device, "tms32015", "Texas Instruments TMS32015")
DEFINE_DEVICE_TYPE(TMS32016, tms32016_device, "tms32016", "Texas Instruments TMS32016")
// TMS320x17 (4K on-chip ROM with internal peripherals, no off-chip program space)

/****************************************************************************
 *  TMS32010 Internal Memory Map (144 Word on-chip RAM)
 ****************************************************************************/

void tms3201x_base_device::ram_144_map(address_map &map)
{
	map(0x00, 0x7f).ram();     /* Page 0 */
	map(0x80, 0x8f).ram();     /* Page 1 */
}

/****************************************************************************
 *  TMS32014/5/6/7 Internal Memory Map (256 Word on-chip RAM)
 ****************************************************************************/

void tms3201x_base_device::ram_256_map(address_map &map)
{
	map(0x00, 0x7f).ram();     /* Page 0 */
	map(0x80, 0xff).ram();     /* Page 1 */
}


tms3201x_base_device::tms3201x_base_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock, int addr_width, uint32_t rom_size, address_map_constructor data_map, address_map_constructor io_map)
	: cpu_device(mconfig, type, tag, owner, clock)
	, m_program_config("program", ENDIANNESS_BIG, 16, addr_width, -1)
	, m_data_config("data", ENDIANNESS_BIG, 16, 8, -1, data_map)
	, m_io_config("io", ENDIANNESS_BIG, 16, 4, -1, io_map)
	, m_bio_in(*this)
	, m_addr_mask((1 << addr_width) - 1)
	, m_rom_size(rom_size)
	, m_mp_mc(true)
	, m_internal_rom(*this, "internal")
{
}


// 4K off-chip Program Space, 1.5K on-chip ROM
tms32010_device::tms32010_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock, address_map_constructor io_map)
	: tms3201x_base_device(mconfig, type, tag, owner, clock, 12, 0x600, address_map_constructor(FUNC(tms32010_device::ram_144_map), this), io_map)
{
}

tms32010_device::tms32010_device(const machine_config &mconfig, const char *tag, device_t *owner, uint32_t clock)
	: tms32010_device(mconfig, TMS32010, tag, owner, clock, address_map_constructor())
{
}

// 4K on-chip ROM or EPROM ('E15)
tms32015_device::tms32015_device(const machine_config &mconfig, device_type type, const char *tag, device_t *owner, uint32_t clock, address_map_constructor io_map)
	: tms3201x_base_device(mconfig, type, tag, owner, clock, 12, 0x1000, address_map_constructor(FUNC(tms32015_device::ram_256_map), this), io_map)
{
}

