mamedev/mame/src/devices/cpu/tms32010/tms32010.cpp
const tms3201x_base_device::tms32010_opcode tms3201x_base_device::s_opcode_7F[32]=
{
/*80*/  {1, &tms3201x_base_device::nop     },{1, &tms3201x_base_device::dint      },{1, &tms3201x_base_device::eint      },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },
/*88*/  {1, &tms3201x_base_device::abst    },{1, &tms3201x_base_device::zac       },{1, &tms3201x_base_device::rovm      },{1, &tms3201x_base_device::sovm      },{2, &tms3201x_base_device::cala      },{2, &tms3201x_base_device::ret       },{1, &tms3201x_base_device::pac       },{1, &tms3201x_base_device::apac      },
/*90*/  {1, &tms3201x_base_device::spac    },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },
/*98*/  {0, &tms3201x_base_device::illegal },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   },{2, &tms3201x_base_device::push      },{2, &tms3201x_base_device::pop       },{0, &tms3201x_base_device::illegal   },{0, &tms3201x_base_device::illegal   }
};

int tms3201x_base_device::add_branch_cycle()
{
	return s_opcode_main[m_opcode.b.h].cycles;
}

/****************************************************************************
 *  Inits CPU emulation
 ****************************************************************************/

void tms3201x_base_device::device_start()
{
	const int addr_width = m_program_config.addr_width();
	if (addr_width > 12) // for 16 bit address pin (TMS320x16)
	{
		space(AS_PROGRAM).cache(m_cache16);
		space(AS_PROGRAM).specific(m_program16);

		m_op_r16 = [this](offs_t address) -> u16     { return m_cache16.read_word(address & m_addr_mask); };

		m_prg_r16 = [this](offs_t address) -> u16    { return m_program16.read_word(address & m_addr_mask); };
		m_prg_w16 = [this](offs_t address, u16 data) { m_program16.write_word(address & m_addr_mask, data); };
	}
	else
	{
		space(AS_PROGRAM).cache(m_cache);
		space(AS_PROGRAM).specific(m_program);

		m_op_r16 = [this](offs_t address) -> u16     { return m_cache.read_word(address & m_addr_mask); };

		m_prg_r16 = [this](offs_t address) -> u16    { return m_program.read_word(address & m_addr_mask); };
		m_prg_w16 = [this](offs_t address, u16 data) { m_program.write_word(address & m_addr_mask, data); };
	}
	space(AS_DATA).specific(m_data);
	space(AS_IO).specific(m_io);

	m_bio_in.resolve_safe(0);

	if (!m_mp_mc) // Use internal mode if Microcomputer mode (MP/MC pin low)
	{
		if (m_internal_rom)
		{
			if (addr_width > 12)
				m_program16.space().install_rom(0x0000, std::min<offs_t>(0xffff, m_rom_size - 1), m_internal_rom->base());
			else
				m_program.space().install_rom(0x000, std::min<offs_t>(0xfff, m_rom_size - 1), m_internal_rom->base());
		}
		else
			fatalerror("TMS3201x %s: Microcomputer mode but Internal ROM is not allocated!", tag());
	}

	save_item(NAME(m_PC));
	save_item(NAME(m_PREVPC));
	save_item(NAME(m_STR));
	save_item(NAME(m_ACC.d));
	save_item(NAME(m_ALU.d));
	save_item(NAME(m_Preg.d));
	save_item(NAME(m_Treg));
	save_item(NAME(m_AR));
	save_item(NAME(m_STACK));
	save_item(NAME(m_INTF));
	save_item(NAME(m_opcode.d));
	save_item(NAME(m_oldacc.d));
	save_item(NAME(m_memaccess));
	save_item(NAME(m_mp_mc));

	m_PREVPC = 0;
	m_ALU.d = 0;
	m_Preg.d = 0;
	m_Treg = 0;
	m_AR[0] = m_AR[1] = 0;
	m_STACK[0] = m_STACK[1] = m_STACK[2] = m_STACK[3] = 0;
	m_opcode.d = 0;
	m_oldacc.d = 0;
	m_memaccess = 0;
	m_PC = 0;
	m_STR = 0;
	m_ACC.d = 0;

	state_add( TMS32010_PC,   "PC",   m_PC).formatstr("%04X");
	state_add( TMS32010_STR,  "STR",  m_STR).formatstr("%04X");
	state_add( TMS32010_ACC,  "ACC",  m_ACC.d).formatstr("%08X");
	state_add( TMS32010_PREG, "P",    m_Preg.d).formatstr("%08X");
	state_add( TMS32010_TREG, "T",    m_Treg).formatstr("%04X");
	state_add( TMS32010_AR0,  "AR0",  m_AR[0]).formatstr("%04X");
	state_add( TMS32010_AR1,  "AR1",  m_AR[1]).formatstr("%04X");
	state_add( TMS32010_STK0, "STK0", m_STACK[0]).formatstr("%04X");
	state_add( TMS32010_STK1, "STK1", m_STACK[1]).formatstr("%04X");
	state_add( TMS32010_STK2, "STK2", m_STACK[2]).formatstr("%04X");
	state_add( TMS32010_STK3, "STK3", m_STACK[3]).formatstr("%04X");

	state_add(STATE_GENPC, "GENPC", m_PC).formatstr("%04X").noshow();
	state_add(STATE_GENPCBASE, "CURPC", m_PREVPC).formatstr("%04X").noshow();
	state_add(STATE_GENFLAGS, "GENFLAGS",  m_STR).formatstr("%16s").noshow();

	set_icountptr(m_icount);
}


/****************************************************************************
 *  TMS32010 Reset registers to their initial values
 ****************************************************************************/

void tms3201x_base_device::device_reset()
{
	m_PC    = 0;
	m_ACC.d = 0;
	m_INTF  = TMS32010_INT_NONE;
	/* Setup Status Register : 7efe */
	CLR((OV_FLAG | ARP_REG | DP_REG));
	SET_FLAG((OVM_FLAG | INTM_FLAG));
}


void tms3201x_base_device::state_string_export(const device_state_entry &entry, std::string &str) const
{
	switch (entry.index())
	{
		case STATE_GENFLAGS:
			str = string_format("%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c",
				m_STR & 0x8000 ? 'O':'.',
				m_STR & 0x4000 ? 'M':'.',
				m_STR & 0x2000 ? 'I':'.',
				m_STR & 0x1000 ? '.':'?',
				m_STR & 0x0800 ? 'a':'?',
				m_STR & 0x0400 ? 'r':'?',
				m_STR & 0x0200 ? 'p':'?',
				m_STR & 0x0100 ? '1':'0',
				m_STR & 0x0080 ? '.':'?',
				m_STR & 0x0040 ? '.':'?',
				m_STR & 0x0020 ? '.':'?',
				m_STR & 0x0010 ? '.':'?',
				m_STR & 0x0008 ? '.':'?',
				m_STR & 0x0004 ? 'd':'?',
				m_STR & 0x0002 ? 'p':'?',
				m_STR & 0x0001 ? '1':'0'
			);
			break;
	}
}


/****************************************************************************
 *  Set IRQ line state
 ****************************************************************************/

void tms3201x_base_device::execute_set_input(int irqline, int state)
{
	/* Pending Interrupts cannot be cleared! */
	if (state == ASSERT_LINE) m_INTF |= TMS32010_INT_PENDING;
}



/****************************************************************************
 *  Issue an interrupt if necessary
 ****************************************************************************/

int tms3201x_base_device::Ext_IRQ()
{
	if (INTM == 0)
	{
		logerror("TMS32010:  EXT INTERRUPT\n");
		m_INTF = TMS32010_INT_NONE;
		SET_FLAG(INTM_FLAG);
		PUSH_STACK(m_PC);
		m_PC = 0x0002;
		return (s_opcode_7F[0x1c].cycles + s_opcode_7F[0x01].cycles);   /* 3 cycles used due to PUSH and DINT operation ? */
	}
	return (0);
}


/****************************************************************************
 *  Execute IPeriod. Return 0 if emulation should be stopped
 ****************************************************************************/

void tms3201x_base_device::execute_run()
{
	do
	{
		if (m_INTF) {
			/* Dont service INT if previous instruction was MPY, MPYK or EINT */
			if ((m_opcode.b.h != 0x6d) && ((m_opcode.b.h & 0xe0) != 0x80) && (m_opcode.w.l != 0x7f82))
				m_icount -= Ext_IRQ();
		}

		m_PREVPC = m_PC;

		debugger_instruction_hook(m_PC);

		m_opcode.d = M_RDOP(m_PC);
		m_PC++;

		if (m_opcode.b.h != 0x7f)   { /* Do all opcodes except the 7Fxx ones */
			m_icount -= s_opcode_main[m_opcode.b.h].cycles;
			(this->*s_opcode_main[m_opcode.b.h].function)();
		}
		else { /* Opcode major byte 7Fxx has many opcodes in its minor byte */
			m_icount -= s_opcode_7F[(m_opcode.b.l & 0x1f)].cycles;
			(this->*s_opcode_7F[(m_opcode.b.l & 0x1f)].function)();
		}
	} while (m_icount > 0);
}
